blasiusFoamCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     mySimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

adjustTimeStep  yes; 

maxCo		1; 

timePrecision   8;

runTimeModifiable true;

functions
{
//    minMax
//    {
//        type          fieldMinMax;
//        libs          (fieldFunctionObjects);
//        writeControl  timeStep; //writeTime;
//        fields        (U);
//    }
//    #includeFunc "writeCellCentres"
//    #includeFunc "wallShearStress"
}

// ************************************************************************* //
