blasiusFoamCase/system/sampleLowerPatch
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            bottomWall;

operation       none;

fields
(
    wallShearStress

);
